# Задача 1.
# Напишите функцию, которая будет принимать номер кредитной карты и
# показывать только последние 4 цифры. Остальные цифры
# должны заменяться звездочками
# def karta(card='1234567891239567'):
#     new_card = '*' * 12 + card[-4:]
#     print(new_card)
#
#
# karta()



# Задача 2.
# Напишите функцию, которая проверяет: является ли слово палиндромом

# stroka = input('Введите слово: ')
#
#
# def check_palindrome(stroka):
#     reversed_stroka = stroka[::-1]
#
#     if stroka == reversed_stroka:
#         print(stroka, "is a Palindrome")
#     else:
#         print(stroka, "is not a Palindrome")
#
#
# check_palindrome(stroka)
